# PresetInitialColor Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PresetInitialColor Members
PresetInitialColor Class Constructors Methods Properties See Also
---
The PresetInitialColor type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PresetInitialColor(ColorPreset) | Creates an initial color preset object with the given preset value. |
| PresetInitialColor(PresetInitialColor) | Creates a copy of the given preset initial color |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clone | Creates a copy of the InitialColor derived object.  (Inherited from InitialColor.) |
| Dispose | (Inherited from InitialColor.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from InitialColor.) |
| Preset | The preset value |
| TemperatureValue | The light color temperature value in Kelvins.  (Inherited from InitialColor.) |

# See Also
PresetInitialColor Class
Autodesk.Revit.DB.Lighting Namespace